/**
* +----------------------------------------------------------------------
* | 容易养老  - 开启家政营销新纪元
* +----------------------------------------------------------------------
* | Copyright (c) 2024 容易科技技术支持
* +----------------------------------------------------------------------
* | 2024
* +----------------------------------------------------------------------
* | Author: www.test.com
* +----------------------------------------------------------------------
*/

// components/copyright.js


const app = getApp()

Component({
    /**
     * 组件的属性列表
     */
    properties: {

    },

    ready: function () {

    },

    /**
     * 组件的初始数据
     */
    data: {
        text: "容易科技 技术支持"
    },

    /**
     * 组件的方法列表
     */
    methods: {

      showToast(){
        wx.showToast({
          title: '©容易养老技术支持',
          icon: 'none',
        })
      },

        sayHello: function () {
            wx.showToast({
                icon: 'none',
                title: '容易:www.test.com',
            })
        }
    }
})
