/**
* +----------------------------------------------------------------------
* | 容易养老  - 开启家政营销新纪元
* +----------------------------------------------------------------------
* | Copyright (c) 2024 容易科技技术支持
* +----------------------------------------------------------------------
* | 2024
* +----------------------------------------------------------------------
* | Author: www.test.com
* +----------------------------------------------------------------------
*/
// components/box.js
Component({
    options: {
    },
    /**
     * 组件的属性列表
     */
    properties: {
        borderRadius: { type: Number, value: 8 },
        width: {
            type: Number, value: 750,
        },

        shadow: {
            type: Boolean, value: false,
        },

        padding: {
            type: Number, value: 0,
        },


    },

    /**
     * 组件的初始数据
     */
    data: {

    },

    /**
     * 组件的方法列表
     */
    methods: {

    }
})
