/**
* +----------------------------------------------------------------------
* | 容易养老  - 开启家政营销新纪元
* +----------------------------------------------------------------------
* | Copyright (c) 2024 容易科技技术支持
* +----------------------------------------------------------------------
* | 2024
* +----------------------------------------------------------------------
* | Author: www.test.com
* +----------------------------------------------------------------------
*/
const app = getApp()
module.exports = {

    setCity: function () {
        // 根据获取到的位置信息自动判断用户所在城市
        // 如果无法获取位置信息，或者关闭了权限，则设置默认位置
        var _this = this

        wx.getFuzzyLocation({
            type: 'gcj02 ',
            altitude: false,
            isHighAccuracy: false,
            success: function (poi) {
                // 解析地址
                console.log("获取当前地理位置", poi)
            },
            fail: function (res) {
                // TODO 获取位置信息失败
                // console.log("无法获取当前定位信息", res)
            },
        })
    },

}