/**
* +----------------------------------------------------------------------
* | 容易养老  - 开启家政营销新纪元
* +----------------------------------------------------------------------
* | Copyright (c) 2024 容易科技技术支持
* +----------------------------------------------------------------------
* | 2024
* +----------------------------------------------------------------------
* | Author: www.test.com
* +----------------------------------------------------------------------
*/
function throttle (fn, delay) {
    // 记录上一次函数触发的时间
    if (delay == null || delay == undefined) {
        delay = 1500
    }
    var lastTime = 0;
    return function () {
        // 记录当前函数触发的时间
        var nowTime = Date.now();
        if (nowTime - lastTime > delay) {
            fn.apply(this, arguments);
            // 同步时间
            lastTime = nowTime;
        }
    }
}


module.exports = {

    throttle: throttle,
}