/**
* +----------------------------------------------------------------------
* | 容易养老  - 开启家政营销新纪元
* +----------------------------------------------------------------------
* | Copyright (c) 2024 容易科技技术支持
* +----------------------------------------------------------------------
* | 2024
* +----------------------------------------------------------------------
* | Author: www.test.com
* +----------------------------------------------------------------------
*/
// components/pagemaker/searchbar/search-icon.js
Component({
    /**
     * 组件的属性列表
     */
    properties: {
        url: { type: String, default: null }
    },

    /**
     * 组件的初始数据
     */
    data: {
        defaultIcon: "https://tcdn.udeve.net/assets/icons/search-icon.png",

    },

    /**
     * 组件的方法列表
     */
    methods: {

    }
})
