/**
* +----------------------------------------------------------------------
* | 容易养老  - 开启家政营销新纪元
* +----------------------------------------------------------------------
* | Copyright (c) 2024 容易科技技术支持
* +----------------------------------------------------------------------
* | 2024
* +----------------------------------------------------------------------
* | Author: www.test.com
* +----------------------------------------------------------------------
*/
let request = require('../utils/request.js');

/** 
 * 首页开屏广告接口
 * **/

// 拉取开屏广告列表
export function getFirstScreen () {
    return request.get("/api/v6/first_screen_adds/");
}

// 更新广告数据 
export function updateFirstScreenAdd (data) {
    return request.put("/api/v6/first_screen_adds/" + data.id, data);
}

