/**
* +----------------------------------------------------------------------
* | 容易养老  - 开启家政营销新纪元
* +----------------------------------------------------------------------
* | Copyright (c) 2024 容易科技技术支持
* +----------------------------------------------------------------------
* | 2024
* +----------------------------------------------------------------------
* | Author: www.test.com
* +----------------------------------------------------------------------
*/
let request = require('../utils/request.js');


// 查询热门搜索列表
export function getHotSearchList (query) {
    return request.get("/api/v6/hot_search", query);
}

// 当用户搜索某个楼盘的时候，标记热门搜索   
export function createHoutSearch (postId) {
    return request.post("/api/v6/hot_search", { post_id: postId });
}