/**
* +----------------------------------------------------------------------
* | 容易养老  - 开启家政营销新纪元
* +----------------------------------------------------------------------
* | Copyright (c) 2024 容易科技技术支持
* +----------------------------------------------------------------------
* | 2024
* +----------------------------------------------------------------------
* | Author: www.test.com
* +----------------------------------------------------------------------
*/
let request = require('../utils/request');

/** 
 * 活动模块接口
 * **/

// 拉取活动列表
export function getTourList (query) {
    return request.get("/api/v6/tours/", query);
}

// 拉取活动详情
export function getTourDetail (tourId, query = {}) {
    return request.get("/api/v6/tours/" + tourId, query);
}