/**
* +----------------------------------------------------------------------
* | 容易养老  - 开启家政营销新纪元
* +----------------------------------------------------------------------
* | Copyright (c) 2024 容易科技技术支持
* +----------------------------------------------------------------------
* | 2024
* +----------------------------------------------------------------------
* | Author: www.test.com
* +----------------------------------------------------------------------
*/
let request = require('../utils/request.js');

// 拉取视频列表
export function getVideoList (query) {
	return request.get("/api/v6/videos", query);
}

// 增加视频浏览量
export function addVideoViews (id) {
	return request.post("/api/v6/videos/view/" + id);
}